In [1]:
import pandas as pd

In [5]:
dates_df = pd.read_csv('dates.csv')
dates_df.sample(n=5)

                      date
42714  2000-12-06 16:46:27
85168  2008-08-24 06:37:11
36336  2018-08-18 11:38:02
21674  2006-07-14 17:33:05
35908  2000-11-24 18:49:49

In [4]:
movies_df = pd.read_csv('movies.csv')
movies_df.sample(n=5)

,movieId,title,genres
3405,4632,"Package, The (1989)",Action|Thriller
1014,1325,Amityville: A New Generation (1993),Horror
5662,27595,Jesus Christ Vampire Hunter (2001),Action|Comedy|Horror|Musical
9397,164375,All Roads Lead to Rome (2016),Comedy
8983,138702,Feast (2014),Animation|Children|Comedy|Drama|Romance

In [6]:
rate1_df = pd.read_csv('ratings1.csv')
rate1_df.head()

   userId  movieId  rating
0       1        1     4.0
1       1        3     4.0
2       1        6     4.0
3       1       47     5.0
4       1       50     5.0

In [8]:
rate2_df = pd.read_csv('ratings2.csv')
rate2_df.head()

   userId  movieId  rating
0     274     5621     2.0
1     274     5630     3.0
2     274     5667     3.5
3     274     5679     3.5
4     274     5690     3.0

In [9]:
movies_df['movieId'].nunique()

9742

In [12]:
rate1_df['userId'].nunique()

274

In [13]:
dates_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    100836 non-null  object
dtypes: object(1)
memory usage: 787.9+ KB

In [18]:
dates_df['date'] = pd.to_datetime(dates_df['date'])
dates_df['date'].dt.year.mode()[0]

2000